research/hardware.org
#+TITLE: Hardware
#+FILETAGS: research
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>

* TODO In-depth OOO execution details
** TODO Tomosuolo algorithm
** TODO What's a reservation station?
* *Modern Microprocessors - A 90-minute guide*
- http://www.lighterra.com/papers/modernmicroprocessors/
** Pipelining and instruction-level parallelism
  - Instructions executed in pipeline.
  - Typical four stage pipeline:
    - Fetch instruction from memory
    - Decode instruction
      - this means decompose instruction into microcode, compute jump target, read
        register values into latches, etc.
    - Execute instruction
    - Writeback results to registers, memory etc.
  - With a full pipeline, processor will retire one instruction every cycle
    - Clocks-per-instruction (CPI) = 1
  - Pipeline stages are linked by latches which are synchronized by clock signal.
  - Two consecutive instructions A and B, where B depends on output of A:
    - B would be at EXECUTE stage when A is performing WRITEBACK
    - So if B needs output of A, pipeline has to stall for one clock
    - Instead, pipeline can write results of execute to latch inputs of B's execute phase
      - (and also from writeback, to avoid having to read registers)
** Deeper pipelines - *superpipelining*
  - Clock speed limited by length of slowest stage in pipeline (so makes sense to make
    pipeline stages short)
  - This means more cycles per instruction, but more cycles per second so higher
    throughput
  - Modern pipelines are about 15-20 stages deep
    - Pentium 4 went nuts with 30+ stages
    - x86 processors have to do more work to support CISC instruction set than RISC CPUs.
  - Remember - deep pipelines -> higher clock speed
** Multiple issue - *superscalar*
 - Lots of different functional units, not all in use for a given instruction (e.g. ALU,
   FPU). Why not issue multiple instructions to take advantage of idle hardware?
 - Now fetch / decode stages need to be able to do multiple instructions in parallel.
 - Might be able to retire more than one instruction per clock (i.e. CPI < 1)
 - "issue width" -> Number of instructions in flight at one time.
 - Virtually every processor is superpipelined and superscalar, so just called superscalar
   for short.
** Explicit parallelism - VLIW
- Idea is to design instruction set to explicitly group instructions to be executed in
  parallel.
- i.e. instructions themselves indicate to CPU that there are few or no dependencies.
- Instructions are 128 bits or more, hence "Very Long Instruction Word"
- Fetch and decode happens once every word, but execute / writeback happens multiple times
  per instruction.
- No need for parallel fetch or decode, so simpler.
- Most designs not "interlocked", i.e. no dependency checking is done between instructions.
  - As a result, compiler has to insert manual NOPs to stall pipeline between dependent
    instructions.
  - Not clear why - maybe complexity of dependency checking for VLIWs is higher?
  - Or maybe dependency checking happens in frontend and complexity savings of VLIW would
    be moot with it?
- Itanium was VLIW. GPU shader chips are sometimes VLIW.

** Instruction dependencies and latencies
- Why not build 50-stage pipeline which issues 20 instructions per clock?
- Answer: dependencies.
- In a long pipeline, the number of stages between starting EXECUTE and results being
  available can be very high. That is the number of clock cycles that dependent
  instructions would need to be stalled for.
- So length of pipeline eventually diminishes its returns.
** Branches and branch prediction
- Another problem for pipelining. CPU doesn't know which instruction is next, so has to
  stall FETCH until previous instruction writes IP.
- So processor guesses based on branch predictor. Output of speculated instructions not
  committed until previous instruction is retired (I think this doesn't require stalling
  though - previous instruction will be at WRITEBACK when current instruction is in
  EXECUTE, so WRITEBACK of current instruction will know whether or not to discard
  results)
- Misprediction penalty can be very high, as it means an entire pipeline stall.
** Eliminating branches with predication
- If target of branch is basically one instruction, possible to have that instruction
  combined with branch logic, so no speculation required.
- e.g. cmovle d, b ; if result of compare is <=, b = d
  - executes in one instruction, no ambiguity about fetching next instruction
  - I suppose there's still a one-cycle penalty if branch not taken because nothing is
    retired usefully from cmovle.
- _Larger example_:
  cmp a, 7
  mov c, b
  cmovle d, b
  - Means if (a <= 7) b =d else b = c.
  - Execute the 'else' branch *whatever* (mov c, b), and then overwrite it using
    conditional move. This increases parallelism - cmp and mov can be executed in parallel
    as only the cmovle has a dependency on either.
