research/hardware.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-06-01 Sat 12:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Henry Robinson" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0b64f18">1. <span class="todo TODO">TODO</span> In-depth OOO execution details</a>
<ul>
<li><a href="#org91702b5">1.1. <span class="todo TODO">TODO</span> Tomosuolo algorithm</a></li>
<li><a href="#org7566b8c">1.2. <span class="todo TODO">TODO</span> What's a reservation station?</a></li>
</ul>
</li>
<li><a href="#org74abe1f">2. <b>Modern Microprocessors - A 90-minute guide</b></a>
<ul>
<li><a href="#org781c3dc">2.1. Pipelining and instruction-level parallelism</a></li>
<li><a href="#org92982be">2.2. Deeper pipelines - <b>superpipelining</b></a></li>
<li><a href="#orgb699faf">2.3. Multiple issue - <b>superscalar</b></a></li>
<li><a href="#orga2ac713">2.4. Explicit parallelism - VLIW</a></li>
<li><a href="#org0abcfcb">2.5. Instruction dependencies and latencies</a></li>
<li><a href="#org386ade3">2.6. Branches and branch prediction</a></li>
<li><a href="#orge1307d2">2.7. Eliminating branches with predication</a></li>
<li><a href="#orga06637d">2.8. Instruction scheduling, register renaming &amp; OOO</a></li>
<li><a href="#org178bbc2">2.9. The <span class="underline">Brainiac Debate</span></a></li>
<li><a href="#orgb7665fd">2.10. The Power Wall &amp; The ILP Wall</a></li>
<li><a href="#org5a9ac61">2.11. What about x86?</a></li>
<li><a href="#org36eb410">2.12. Threads - SMT, Hyper-Threading and Multi-Core</a></li>
<li><a href="#org699c0da">2.13. More cores or wider cores?</a></li>
<li><a href="#org8232309">2.14. Data Parallelism - SIMD Vector Instructions</a></li>
<li><a href="#org96b4945">2.15. Memory and the memory wall</a></li>
<li><a href="#org8fecc3c">2.16. Caches and the memory hierarchy</a></li>
</ul>
</li>
<li><a href="#org008c4c3">3. <b>FPGA architecture</b></a>
<ul>
<li><a href="#orgbaf6ede">3.1. Reprogrammable logic gates</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org0b64f18" class="outline-2">
<h2 id="org0b64f18"><span class="section-number-2">1</span> <span class="todo TODO">TODO</span> In-depth OOO execution details</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org91702b5" class="outline-3">
<h3 id="org91702b5"><span class="section-number-3">1.1</span> <span class="todo TODO">TODO</span> Tomosuolo algorithm</h3>
</div>
<div id="outline-container-org7566b8c" class="outline-3">
<h3 id="org7566b8c"><span class="section-number-3">1.2</span> <span class="todo TODO">TODO</span> What's a reservation station?</h3>
</div>
</div>
<div id="outline-container-org74abe1f" class="outline-2">
<h2 id="org74abe1f"><span class="section-number-2">2</span> <b>Modern Microprocessors - A 90-minute guide</b></h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="http://www.lighterra.com/papers/modernmicroprocessors/">http://www.lighterra.com/papers/modernmicroprocessors/</a></li>
</ul>
</div>
<div id="outline-container-org781c3dc" class="outline-3">
<h3 id="org781c3dc"><span class="section-number-3">2.1</span> Pipelining and instruction-level parallelism</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Instructions executed in pipeline.</li>
<li>Typical four stage pipeline:
<ul class="org-ul">
<li>Fetch instruction from memory</li>
<li>Decode instruction
<ul class="org-ul">
<li>this means decompose instruction into microcode, compute jump target, read
register values into latches, etc.</li>
</ul></li>
<li>Execute instruction</li>
<li>Writeback results to registers, memory etc.</li>
</ul></li>
<li>With a full pipeline, processor will retire one instruction every cycle
<ul class="org-ul">
<li>Clocks-per-instruction (CPI) = 1</li>
</ul></li>
<li>Pipeline stages are linked by latches which are synchronized by clock signal.</li>
<li>Two consecutive instructions A and B, where B depends on output of A:
<ul class="org-ul">
<li>B would be at EXECUTE stage when A is performing WRITEBACK</li>
<li>So if B needs output of A, pipeline has to stall for one clock</li>
<li>Instead, pipeline can write results of execute to latch inputs of B's execute phase
<ul class="org-ul">
<li>(and also from writeback, to avoid having to read registers)</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org92982be" class="outline-3">
<h3 id="org92982be"><span class="section-number-3">2.2</span> Deeper pipelines - <b>superpipelining</b></h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Clock speed limited by length of slowest stage in pipeline (so makes sense to make
pipeline stages short)</li>
<li>This means more cycles per instruction, but more cycles per second so higher
throughput</li>
<li>Modern pipelines are about 15-20 stages deep
<ul class="org-ul">
<li>Pentium 4 went nuts with 30+ stages</li>
<li>x86 processors have to do more work to support CISC instruction set than RISC CPUs.</li>
</ul></li>
<li>Remember - deep pipelines -&gt; higher clock speed</li>
</ul>
</div>
</div>
<div id="outline-container-orgb699faf" class="outline-3">
<h3 id="orgb699faf"><span class="section-number-3">2.3</span> Multiple issue - <b>superscalar</b></h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Lots of different functional units, not all in use for a given instruction (e.g. ALU,
FPU). Why not issue multiple instructions to take advantage of idle hardware?</li>
<li>Now fetch / decode stages need to be able to do multiple instructions in parallel.</li>
<li>Might be able to retire more than one instruction per clock (i.e. CPI &lt; 1)</li>
<li>"issue width" -&gt; Number of instructions in flight at one time.</li>
<li>Virtually every processor is superpipelined and superscalar, so just called superscalar
for short.</li>
</ul>
</div>
</div>
<div id="outline-container-orga2ac713" class="outline-3">
<h3 id="orga2ac713"><span class="section-number-3">2.4</span> Explicit parallelism - VLIW</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>Idea is to design instruction set to explicitly group instructions to be executed in
parallel.</li>
<li>i.e. instructions themselves indicate to CPU that there are few or no dependencies.</li>
<li>Instructions are 128 bits or more, hence "Very Long Instruction Word"</li>
<li>Fetch and decode happens once every word, but execute / writeback happens multiple times
per instruction.</li>
<li>No need for parallel fetch or decode, so simpler.</li>
<li>Most designs not "interlocked", i.e. no dependency checking is done between instructions.
<ul class="org-ul">
<li>As a result, compiler has to insert manual NOPs to stall pipeline between dependent
instructions.</li>
<li>Not clear why - maybe complexity of dependency checking for VLIWs is higher?</li>
<li>Or maybe dependency checking happens in frontend and complexity savings of VLIW would
be moot with it?</li>
</ul></li>
<li>Itanium was VLIW. GPU shader chips are sometimes VLIW.</li>
</ul>
</div>
</div>

<div id="outline-container-org0abcfcb" class="outline-3">
<h3 id="org0abcfcb"><span class="section-number-3">2.5</span> Instruction dependencies and latencies</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>Why not build 50-stage pipeline which issues 20 instructions per clock?</li>
<li>Answer: dependencies.</li>
<li>In a long pipeline, the number of stages between starting EXECUTE and results being
available can be very high. That is the number of clock cycles that dependent
instructions would need to be stalled for.</li>
<li>So length of pipeline eventually diminishes its returns.</li>
</ul>
</div>
</div>
<div id="outline-container-org386ade3" class="outline-3">
<h3 id="org386ade3"><span class="section-number-3">2.6</span> Branches and branch prediction</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li>Another problem for pipelining. CPU doesn't know which instruction is next, so has to
stall FETCH until previous instruction writes IP.</li>
<li>So processor guesses based on branch predictor. Output of speculated instructions not
committed until previous instruction is retired (I think this doesn't require stalling
though - previous instruction will be at WRITEBACK when current instruction is in
EXECUTE, so WRITEBACK of current instruction will know whether or not to discard
results)</li>
<li>Misprediction penalty can be very high, as it means an entire pipeline stall.</li>
</ul>
</div>
</div>
<div id="outline-container-orge1307d2" class="outline-3">
<h3 id="orge1307d2"><span class="section-number-3">2.7</span> Eliminating branches with predication</h3>
<div class="outline-text-3" id="text-2-7">
<ul class="org-ul">
<li>If target of branch is basically one instruction, possible to have that instruction
combined with branch logic, so no speculation required.</li>
<li>e.g. cmovle d, b ; if result of compare is &lt;=, b = d
<ul class="org-ul">
<li>executes in one instruction, no ambiguity about fetching next instruction</li>
<li>I suppose there's still a one-cycle penalty if branch not taken because nothing is
retired usefully from cmovle.</li>
</ul></li>
<li><span class="underline">Larger example</span>:
cmp a, 7
mov c, b
cmovle d, b
<ul class="org-ul">
<li>Means if (a &lt;= 7) b =d else b = c.</li>
<li>Execute the 'else' branch <b>whatever</b> (mov c, b), and then overwrite it using
conditional move. This increases parallelism - cmp and mov can be executed in parallel
as only the cmovle has a dependency on either.</li>
</ul></li>
</ul>
</div>
</div>
