research/hardware.html
<div id="outline-container-orga06637d" class="outline-3">
<h3 id="orga06637d"><span class="section-number-3">2.8</span> Instruction scheduling, register renaming &amp; OOO</h3>
<div class="outline-text-3" id="text-2-8">
<ul class="org-ul">
<li>If there are bubbles in the pipeline, what can be done to put those idle stages to good
work? One possibility - issue instructions <b>Out Of Order</b> so that while one instruction
is stalled, others can execute.</li>
<li>One way to do this is to reorder in the hardware at runtime. Decode / dispatch logic
must be extended to look at groups of instructions and dispatch them as best it can
given possible dependencies. This is <b>Out Of Order Execution</b> or <b>OOO</b>.
<ul class="org-ul">
<li>To keep track of dependencies between instructions, <b>rename registers</b> so that hazards
are explicit (and reduce false-positives where there's benign dependencies on same
register).</li>
<li>OOO, dependency analysis, register renaming add a lot of complex logic - making CPU
larger, hotter, harder to design and more power-hungry.</li>
<li>But OOO means that software need not be recompiled to get more fine-grained
parallelism.</li>
</ul></li>
<li>Alternatively: have compiler rearrange instructions. Processor can be <b>in-order</b> on the
assumption that the compiler gives the best instruction stream.
<ul class="org-ul">
<li>Other advantages - compiler can see further down program than hardware, and can
speculate down multiple branches (CPUs can typically do just one).</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org178bbc2" class="outline-3">
<h3 id="org178bbc2"><span class="section-number-3">2.9</span> The <span class="underline">Brainiac Debate</span></h3>
<div class="outline-text-3" id="text-2-9">
<ul class="org-ul">
<li>Is OOO really worth it?
<ul class="org-ul">
<li><b>Brainiacs</b> vs <b>speed-demons</b>
<ul class="org-ul">
<li>Braniacs complex, clever</li>
<li>Speed-demons simple, smaller
<ul class="org-ul">
<li>(Speed-demons could run at higher clock speeds, but clock now limited by power and
thermal issues)</li>
</ul></li>
</ul></li>
</ul></li>
<li>Speed-demons can usually fit more cores on a chip. So are 4 brainiacs faster than 8
speed-demons?</li>
<li>Debate is ongoing - benefits and costs of OOO have been overstated in past.
<ul class="org-ul">
<li>Powerl, clock overheads of OOO have been reduced by engineering</li>
<li>Chip area is still an issue.</li>
<li>Effectiveness of OOO surprisingly disappointing - only maybe 20-40% improvement over
in-order design.
<ul class="org-ul">
<li><b>"The dirty little secret of OOO is that we are often not very much OOO at all"</b></li>
</ul></li>
</ul></li>
<li>Vendors have often gone down one path, then switched.
<ul class="org-ul">
<li>For example, DEC Alpha and MIPS: speed-demon -&gt; brainiac</li>
<li>Sparc moved from brainiac -&gt; speed-demon</li>
<li>Intel most interesting:
<ul class="org-ul">
<li>x86 has to be a little bit brainiac due to complexities of architecture</li>
<li>Pentium Pro was full brainiac.</li>
<li>Then AMD wars turned focus to speed at all cost, and Pentium 4 was highly
speed-demon
<ul class="org-ul">
<li>Pentium 4 had 20-30 stage pipeline to get up to 3.8GHz (!!)</li>
</ul></li>
<li>Itanium was speed-demon, hoping for smart-compilers</li>
<li>However, Itanium failed, Pentium 4 had heat and power issues and was beaten by
Athlons at roughly half the clock speed</li>
<li>So Intel went brainiac on Core processors.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgb7665fd" class="outline-3">
<h3 id="orgb7665fd"><span class="section-number-3">2.10</span> The Power Wall &amp; The ILP Wall</h3>
<div class="outline-text-3" id="text-2-10">
<ul class="org-ul">
<li>Power usage goes up faster than clock speed</li>
<li>W goes up proportional to V*V, and V goes up with clock speed because transistors need
more power to meet higher switching requirements</li>
<li>Result is that 30%+ clock speed can double power requirements (and double heat produced)</li>
<li>So just pumping up clock speed can't work forever</li>
<li>But neither can going full brainiac - there isn't that much ILP in a single program..
<ul class="org-ul">
<li>Average ILP of modern CPU running SPECint is &lt; 2 instructions per cycle (&gt; 0.5 CPI)</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org5a9ac61" class="outline-3">
<h3 id="org5a9ac61"><span class="section-number-3">2.11</span> What about x86?</h3>
<div class="outline-text-3" id="text-2-11">
<ul class="org-ul">
<li>x86 instruction set is CISC and messy - complex addressing modes and not many registers
makes it hard to parallelize instructions because false-positives on dependencies</li>
<li>So <b>dynamically decode</b> x86 instructions into simple, RISC-like micro-instructions and
execute using simple RISC-style core
<ul class="org-ul">
<li>x86 instructions typically decode into 1, 2 or 3 micro-ops.</li>
<li>Static instruction scheduling might be less effective because compiler can't see into RISC core.</li>
<li>Can't fix small register set this way.</li>
<li>Pentium Pro was first Intel chip to do this; today all x86 processors do.</li>
</ul></li>
<li>Some recent chips store uops in a small cache to avoid retranslating during loops.
<ul class="org-ul">
<li>So pipeline stages can be skipped; e.g. Haswell is a 14/19 stage processor. 14 when
running from uop cache, 19 when not.</li>
</ul></li>
<li>This makes talking about the issue width of a CPU a bit tricky (because width should be
measured in uops not instructions)</li>
<li>Even more tricky - some uops get 'fused' into a single uop
<ul class="org-ul">
<li>Presumably this reduces register pressure, and increases uop throughput</li>
<li>Per Agner Fog (<a href="http://www.agner.org/optimize/microarchitecture.pdf">http://www.agner.org/optimize/microarchitecture.pdf</a>, pg 107) - fused
uops act as one instruction everywehere but during execution (where they are sent to
different execution units independently)</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org36eb410" class="outline-3">
<h3 id="org36eb410"><span class="section-number-3">2.12</span> Threads - SMT, Hyper-Threading and Multi-Core</h3>
<div class="outline-text-3" id="text-2-12">
<ul class="org-ul">
<li>Since ILP is actually rather limited, maybe we can take instructions from some other
thread?</li>
<li>Multiplex more than one thread onto a single core.</li>
<li>Requires duplicating state tracking part of core (e.g. instruction pointer, registers,
TLB etc), but not the large parts like decoders, dispatch logic etc.
<ul class="org-ul">
<li>Overhead is ~10%</li>
</ul></li>
<li>Since no dependency between threads, there's lots of parallelism available.</li>
<li>Except&#x2026;
<ul class="org-ul">
<li>Not always lots of CPU-bound threads running at same time</li>
<li>Threads share the same cache</li>
<li>Other resources also shared (e.g. functional units) - if one thread saturates all of a
functional unit, no parallelism available for other thread (e.g. heavy FPU workloads)</li>
</ul></li>
<li>So SMT could actually be worse than single-thread perf. But usually a big win in context
of memory latencies etc.</li>
</ul>
</div>
</div>
<div id="outline-container-org699c0da" class="outline-3">
<h3 id="org699c0da"><span class="section-number-3">2.13</span> More cores or wider cores?</h3>
<div class="outline-text-3" id="text-2-13">
<ul class="org-ul">
<li>Why build multiple cores if an SMT design would be better?
<ul class="org-ul">
<li>Very wide superscalar designs scale very badly</li>
<li>For example, dispatch logic scales with square of issue width, because you have to
compare n*n instruction pairs to be sure about dependencies.</li>
<li>Very wide superscalar also requires multiple ports on register files and caches, to
allow for parallel access.</li>
<li>All this implies more wiring, larger chip size, etc.</li>
<li>So a 10-issue core would possibly be larger and slower than 2*5-issue cores.</li>
</ul></li>
<li>So there's a sweet spot between SMT width and number of cores.
<ul class="org-ul">
<li>e.g. core2 -&gt; 4 cores, 6-issue OOO brainiac cores</li>
<li>or Niagara 3 -&gt; 16 simple 2-issue in-order cores</li>
<li>or Bulldozer - shared, SMT-style front-end for a pair of cores, but back-end is
unshared for integers, and shared for floating-point.</li>
</ul></li>
<li>There are lots of transistors (~6 billion) available. So lots of room to fit logic on a
chip.
<ul class="org-ul">
<li>Although now pressure to integrate more into chip, like SoC.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org8232309" class="outline-3">
<h3 id="org8232309"><span class="section-number-3">2.14</span> Data Parallelism - SIMD Vector Instructions</h3>
<div class="outline-text-3" id="text-2-14">
<ul class="org-ul">
<li>Along with ILP and SMT, a further way to get parallelism is <b>data parallelism</b>.</li>
<li>i.e. run one instruction on a group of data values in parallel.</li>
<li>SIMD instructions can pack multiple values into single registers and operate on them
using a single register operation.</li>
</ul>
</div>
</div>
