research/hardware.org
** Memory and the memory wall
- Access to main memory is very slow.
- Reading a byte can cost ~20 cycles of main memory bus, which can lag CPU clock by a
  factor of three (e.g. 800MHz to 2400MHz)
- So effective cost can be 60 cycles (plus cache checking delay) or more of CPU clock to
  access main memory.
- As ratio of clock speed to bus speed gets larger, delay gets worse.
** Caches and the memory hierarchy
- Caches hide latency. For example, on a core i4:
  - L1 cache -> 4 cycles
  - L2 cache -> 12 cycles
  - L3 cache -> 21 cycles
  - RAM -> 120 cycles
- Temporal and spatial locality make caches highly effective.


* *FPGA architecture*
** Reprogrammable logic gates
   Logic gates are look-up tables (truth tables) which can be reprogrammed
   Connected by fixed-width bus
   Very high parallelism
