research/hardware.html
<div id="outline-container-org96b4945" class="outline-3">
<h3 id="org96b4945"><span class="section-number-3">2.15</span> Memory and the memory wall</h3>
<div class="outline-text-3" id="text-2-15">
<ul class="org-ul">
<li>Access to main memory is very slow.</li>
<li>Reading a byte can cost ~20 cycles of main memory bus, which can lag CPU clock by a
factor of three (e.g. 800MHz to 2400MHz)</li>
<li>So effective cost can be 60 cycles (plus cache checking delay) or more of CPU clock to
access main memory.</li>
<li>As ratio of clock speed to bus speed gets larger, delay gets worse.</li>
</ul>
</div>
</div>
<div id="outline-container-org8fecc3c" class="outline-3">
<h3 id="org8fecc3c"><span class="section-number-3">2.16</span> Caches and the memory hierarchy</h3>
<div class="outline-text-3" id="text-2-16">
<ul class="org-ul">
<li>Caches hide latency. For example, on a core i4:
<ul class="org-ul">
<li>L1 cache -&gt; 4 cycles</li>
<li>L2 cache -&gt; 12 cycles</li>
<li>L3 cache -&gt; 21 cycles</li>
<li>RAM -&gt; 120 cycles</li>
</ul></li>
<li>Temporal and spatial locality make caches highly effective.</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org008c4c3" class="outline-2">
<h2 id="org008c4c3"><span class="section-number-2">3</span> <b>FPGA architecture</b></h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgbaf6ede" class="outline-3">
<h3 id="orgbaf6ede"><span class="section-number-3">3.1</span> Reprogrammable logic gates</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Logic gates are look-up tables (truth tables) which can be reprogrammed
Connected by fixed-width bus
Very high parallelism
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Henry Robinson</p>
<p class="date">Created: 2019-06-01 Sat 12:35</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
